{
  "easymap": {
    "room01": {
      "hasBeenVisited": true,
      "number": 1,
      "name": "Landing Zone",
      "description": "You land in a jungle. There is a path that leads north.",
      "west": "",
      "south": "",
      "north": "room02",
      "east": "",
      "items": [],
      "encounters_to": [],
      "encounters_from": [],
      "sound": "sounds/landing_zone.wav"
    },
    "room02": {
      "hasBeenVisited": false,
      "number": 2,
      "name": "Jungle Path",
      "description": "You traverse through the jungle and arrive at a clearing. A member of your team lies motionless on the ground. It doesn't look as though their parachute ever deployed. To the north lies a path. To the east, you see rubble and an opening in the ground that you might be able to squeeze down into. To the south is the landing zone.",
      "west": "",
      "south": "room01",
      "north": "room03",
      "east": "room05",
      "items": ["desert eagle"],
      "encounters_to": [],
      "encounters_from": [],
      "sound": "sounds/jungle_path.wav"
    },
    "room03": {
      "hasBeenVisited": false,
      "number": 3,
      "name": "Jungle Clearing",
      "description": "You come across a clearing in the jungle. A path lies to the north and the south.",
      "west": "",
      "south": "room02",
      "north": "room04",
      "east": "",
      "items": [],
      "encounters_to": [
        "bald eagle"
      ],
      "encounters_from": [],
      "sound": "sounds/jungle_clearing.wav"
    },
    "room04": {
      "hasBeenVisited": false,
      "number": 4,
      "name": "Base of Temple",
      "description": "At the edge of the jungle lies an immense ancient temple. To the south lies a path back into the jungle. Temple steps lead up to the east.",
      "west": "",
      "south": "room03",
      "north": "",
      "east": "room07",
      "items": ["grenade", "machete"],
      "encounters_to": [ "anaconda" ],
      "encounters_from": [],
      "sound": "sounds/base_of_temple.wav"
    },
    "room05": {
      "hasBeenVisited": false,
      "number": 5,
      "name": "Pit of Face-Mugging Torment",
      "description": "You fall into a pit! Spikes stick out from the ground and egg shaped pods are littered throughout. A dense fog hangs at shin level obscuring the ground. A door leads to the north.",
      "west": "",
      "south": "",
      "north": "room06",
      "east": "",
      "items": [],
      "encounters_to": [ "face mugger" ],
      "encounters_from": [],
      "sound": "sounds/face_mugging_torment.wav"
    },
    "room06": {
      "hasBeenVisited": false,
      "number": 6,
      "name": "Central Chamber",
      "description": "You enter a musty and poorly lit room. Statues of lions sit poised in the corners. There are doors to north, east and south.",
      "west": "",
      "south": "room05",
      "north": "room07",
      "east": "room09",
      "items": [ "flamethrower" ],
      "encounters_to": [],
      "encounters_from": ["lion"],
      "sound": "sounds/central_chamber.wav"
    },
    "room07": {
      "hasBeenVisited": false,
      "number": 7,
      "name": "Temple Entrance",
      "description": "You have entered the temple and find yourself in a candle-lit room revealing strange markings...be careful not to disturb the dead.",
      "west": "room04",
      "south": "room06",
      "north": "",
      "east": "",
      "items": [ "key" ],
      "encounters_to": [],
      "encounters_from": [ "mummy" ],
      "sound": "sounds/temple_entrance.wav"
    },
    "room08": {
      "hasBeenVisited": false,
      "number": 8,
      "name": "Temple Shrine Room",
      "description": "You have entered a what looks to be a shrine. The walls are decorated with murals of what looks like an advanced civilization taking over a lesser one. At the center is an alter. A beam of light shines down on it. To the north is a door.",
      "west": "",
      "south": "",
      "north": "room09",
      "east": "",
      "items": [ "crystal femur" ],
      "encounters_to": [ "alien guard" ],
      "encounters_from": [],
      "sound": "sounds/shrine_room.wav"
    },
    "room09": {
      "hasBeenVisited": false,
      "number": 9,
      "name": "Temple Store room",
      "description": "You enter what looks like a store room. Shelves line the walls where items were once stored. To the north is a door. There is a room to the south with light emanating from it. This store room seems like a safe place to take a quick break.",
      "west": "room06",
      "south": "room08",
      "north": "room10",
      "east": "",
      "items": ["ball o yarn"],
      "encounters_to": [],
      "encounters_from": [],
      "sound": "sounds/store_room.wav"
    },
    "room10": {
      "hasBeenVisited": false,
      "number": 10,
      "name": "Alien Communication Room",
      "description": "You enter a communications room. This must be where the device is. You see a large metallic device in the corner with a web of cables that extend upward into the ceiling.",
      "west": "",
      "south": "room09",
      "north": "",
      "east": "",
      "items": [],
      "encounters_to": [ "alien boss" ],
      "encounters_from": [],
      "sound": "sounds/communication_room.wav"
    }
  },
  "encounters": {
    "alien guard": {
      "name": "alien guard",
      "type": "enemy",
      "description": "An Alien Guard leaps across the altar and braces itself for combat.",
      "weakness": [
        "desert eagle",
        "grenade",
        "machete"
      ],
      "success": "The alien collapses and dies before you!",
      "failure": -1
    },
    "bald eagle": {
      "name": "bald eagle",
      "type": "enemy",
      "description": "A Bald Eagle screams as it dives for toward you!",
      "weakness": [
        "desert eagle"
      ],
      "success": "You fire off a shot into the sky, startling the majestic bald eagle causing it to fly away.",
      "failure": -1
    },
    "lion": {
      "name": "lion",
      "type": "enemy",
      "description": "One of the statues has come to life! A ripped and overly shredded lion with a particular taste for intruders leaps into action.",
      "weakness": [
        "ball O yarn"
      ],
      "success": "You throw the ball O yarn at the lion, and it bats it around like a kitten with a toy. It's way too distracted to care about you now.",
      "failure": -1
    },
    "mummy": {
      "name": "mummy",
      "type": "enemy",
      "description": "Uh-oh now you've done it. You have awakened an evil, vengeful, murderous mummy",
      "weakness": [
        "desert eagle",
        "flamethrower"
      ],
      "success": "The mummy bursts into flames immediately upon your attack. It gets reduced to a pile of ash.",
      "failure": -1
    },
    "face mugger": {
      "name": "face mugger",
      "type": "enemy",
      "description": "A face-mugger lunges at your neck, attempting to wrap its creepy-crawly legs around your cranium to re-arrange your lungs from your face!",
      "weakness": [
        "desert eagle",
        "flamethrower"
      ],
      "success": "You dodge the attack and kill the the face-mugger before it can latch on. No telling how terrible an experience that would have been had it succeeded.",
      "failure": -1
    },
    "pit": {
      "name": "pit",
      "type": "environment",
      "description": "Ahhhhhh!! You have fallen into a black pit at least 10 feet deep!",
      "outcome": -1
    },
    "alien boss": {
      "name": "alien boss",
      "type": "enemy",
      "description": "A very large roided-out-extraterrestrial being stands at the center of the room! It screams something you can't make out,\"^&@%# @&^#*(!( $^$#*(@!!!!\"",
      "weakness": [
        "crystal femur"
      ],
      "success": "Not taking any chances that the alien might just have been trying to communicate, you bludgeon it with the Crystal Femur. The alien leader is knocked unconscious.",
      "failure": -1
    },
    "anaconda": {
      "name": "anaconda",
      "type": "enemy",
      "description": "A giant Anaconda coils itself up, poised to strike at a moment's notice!",
      "weakness": [
        "grenade",
        "desert eagle",
        "machete"
      ],
      "success": "You quickly deal the the Anaconda before it can wrap itself around you. Injured, it slithers back into its hole. Hopefully it won't come back later.",
      "failure": -1
    }
  },
  "items": {
    "desert eagle": {
      "name": "Desert Eagle",
      "room": "room02",
      "damage": 5,
      "description": "The Mark XIX Desert Eagle is a gas-operated, semi-automatic pistol with a 7 round capacity. The gun measures 10.75” in length with a 6” barrel. Width is 1.25”, height 6.25” and the weight with an empty magazine is approximately 72 ounces. It has a trigger reach of 2.75” and a sight radius of 8.5” with the 6” barrel. \n - magnum research",
      "reuse": 2
    },
    "grenade": {
      "name": "Grenade",
      "room": "room04",
      "damage": 5,
      "description": "hand thrown explosive fragmentation grenade... you have at least 3 seconds to dispose of it lol",
      "reuse": 0
    },
    "machete": {
      "name": "Machete",
      "room": "room04",
      "damage": 5,
      "description": "Looks like this machete has seen better days, it looks rusty, has a bent blade and is missing a proper grip. ",
      "reuse": 2
    },
    "flamethrower": {
      "name": "Flamethrower",
      "room": "room06",
      "damage": 5,
      "description": "Sawed-off, Hip Operated, WWI Era, Five Cylinder Inert Propellant (Nitrogen Gas) Flamethrower that is 9/10's spent. Capable of spitting a violent ball of Red Holy Fire in a 180 degree cone of fiery destruction... and it looks heavy.. ",
      "reuse": 0
    },
    "key": {
      "name": "Key",
      "room": "room07",
      "damage": 0,
      "description": "Honestly, it looks like a typical house key... probably not that important",
      "reuse": 0
    },
    "crystal femur": {
      "name": "Crystal Femur",
      "room": "room08",
      "damage": 0,
      "description": "It is painfully clear that this Amethyst Crystal Femur is shaped like a human femur, it is also painfully clear that these aliens must be cheap because Amethyst crystals are some of the cheapest crystals you can get in the market these days",
      "reuse": 99
    },
    "ball O yarn": {
      "name": "Ball O Yarn",
      "room": "room09",
      "damage": 0,
      "description": "An irresistible basketball-sized ball of yarn",
      "reuse": 0
    }
  },
  "game": {
    "title": "Temple Jog",
    "intro": "Welcome Player to Temple Jog! You are a brave soul. Your job is to fail the Aliens attempt from destroying our earth.",
    "story": "A temple in remote location, but it's actually an Alien ship They’re trying to contact their home world so they can invade Earth. A Major Government power is looking to Nuke the whole area because “It’s the only way to be sure” they don’t contact their home world. You are a part of a special ops team that has intel that states even if the site is nuked, the signal will still be sent. \n Your mission (and you already chose to accept it) is to infiltrate the temple and find a means to disable the communication device and get out before the nuke drops. You will be dropped to the south of the temple nearby. Your exfiltration route will be back the way you came in. Ensure you get back to the pick up with enough time for us to pick you up. If you miss the window, we will not be able to safely extract you."
  }
}